{
  "projects": [
    {
      "project": "Quantifying environmental impacts of electric vehicles with human mobility  using artificial intelligence and spatial analysis, The Microsoft AI for Earth Grant, 2018-2019, ",
      "position": "Co-PI"
    },
	{
      "project": "Data Driven Evaluation for Urban Planning (K-17014-1), The Tsinghua University Open Fund for Urban Transformation Research, 2017-2019, ",
      "position": "Co-PI"
    },
    {
      "project": "Urban big data driven transportation analytic (2016065), Natural Science Foundation of Shenzhen University, 2016-2018,",
      "position": "PI"
    },
    {
      "project": "Multi-source spatial-temporal trajectories driven human activity and transportation analysis(KF-2016-02-009), The Open Fund of Key Laboratory of Urban Land Resources Monitoring and Simulation, Ministry of Land and Resources, 2016-2018,",
      "position": "PI"
    },
    {
      "project": "Spatial-temporal Modelling and Optimization for Large Scale City Logistics in Time Varying Transportation Network. Natural Science Foundation of China. 2015.1-2017.12. ",
      "position": "PI"
    },
    {
      "project": "Spatial-temporal Modelling for City Logistics Based on Traffic Information. China Postdoctoral Science Foundation Funded Project,",
      "position": "PI"
    },
    {
      "project": "Big Data Driven Metro Station Location. Funding by urban planning, Land & Resource Commission of Shenzhen Municipality,",
      "position": "PI"
    },
    {
      "project": "Modelling and Analysis of Urban Road Congestion with Vehicle GPS data and Smart Card Data. Funding by Transportation Commission of Shenzhen Municipality. ",
      "position": "Co-PI"
    },
    {
      "project": "Social network spatiotemporal data model and hot events evolution analysis. Natural Science Foundation of China. 2014.1-2016.1 (PI: Qingquan-LI, President of Shenzhen University).",
      "position": "Research Assistant"
    },
    {
      "project": "Using mobile phone tracking data to analyze interactions between group activity patterns and urban spatial structures and to select facility. Natural Science Foundation of China. 2013.1-2016.12 (PI: Shilung-SHAW). ",
      "position": "Research Assistant"
    }
  ]
}