{
  "publications": [
{
      "year": "2018",
	  "type": "Journal article",
      "article": "Xiaohu Zhang, Yang Xu*, Wei Tu, Carlo Ratti, Do different datasets tell the same story about urban mobility — A comparative study of public transit and taxi usage, Journal of Transport Geography,  201870,  78-90.",
	  "level": "SCI",
	  "image": "2018_5.png"
    },
    {
      "year": "2018",
	  "type": "Journal article",
      "article": "Yiyong Chen, Xiaoping Liu*, Wenxiu Gao, Raymond Yu Wang, Yun Li, Wei Tu. Emerging social media data on measuring urban park use. Urban Forestry & Urban Greening. 2018, 30, 130-141.(SSCI).",
	  "level": "SSCI",
	  "image": "2018_4.png"
    },
	{
      "year": "2018",
	  "type": "Journal article",
      "article": "Wei Tu*, Rui Cao, Yang Yue, Baoding Zhou, Qiuping Li, Qingquan Li. Spatial variations in urban public ridership derived from GPS trajectories and smart card data. Journal of Transport Geography. 2018, 69, 45-57.(SSCI).",
	  "level": "SSCI",
	  "image": "2018_3.png"
    },
	{
      "year": "2018",
	  "type": "Journal article",
      "article": "Wei Tu, Zhongwen Hu*, Lefei Li, Jinzhou Cao, Jincheng Jiang, Qiuping Li, Qingquan Li. Portraying Urban Functional Zones by Coupling Remote Sensing Imagery and Human Sensing Data. Remote sensing. 2018, 10(1), 141.(SCI).",
	  "level": "SCI",
	  "image": "2018_2.png"
    },
	{
      "year": "2018",
	  "type": "Journal article",
      "article": "Qiuping Li, Wei Tu*, Li Zhuo . Reliable Rescue Routing Optimization for Urban Emergency Logistics under Travel Time Uncertainty. ISPRS International Journal of Geo-Information. 2018, 7.(SCI).",
	  "level": "SCI",
	  "image": "2018_1.png"
    },
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Baoding Zhou, Qingquan Li*, Qingzhou Mao, Wei Tu*. A Robust Crowdsourcing-Based Indoor Localization System. A Robust Crowdsourcing-Based Indoor Localization System. 2017, 17(4).(SCI).",
	  "level": "SCI",
	  "image": "2017_8.png"
    },
	
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Wei Tu*, Qingquan Li, Qiuping Li, Jiasong Zhu, Baoding Zhou, Biyu Chen. A spatial parallel heuristic approach for solving very large-scale vehicle routing problems. Transaction in GIS. 2017, 21(6), 1130-1147.(SCI).",
	  "level": "SCI",
	  "image": "2017_7.png"
    },
	
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Wei Tu, Jinzhou Cao, Yang Yue*, Shih-lung Shaw, Meng Zhou, Zhensheng Wang, Xiaomeng Chang, Yang Xu, Qingquan Li. Coupling mobile phone and social media data: a new approach to understanding urban functions and diurnal patterns. International Journal of Geographical Information Science. 2017, 31(12), 2331-2358.(SCI).",
	  "level": "SCI",
	  "image": "2017_6.png"
    },
	
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Meng Zhou, Donggen Wang*, Qingquan Li, Yang Yue, Wei Tu, Rui Cao. Impacts of weather on public transport ridership: Results from mining data from different sources. Transportation Research Part C: Emerging Technologies. 2017, 75, 17–29.(SCI).",
	  "level": "SCI",
	  "image": "2017_5.png"
    },	
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Jincheng Jiang, Qingquan Li*, Lixin Wu, Wei Tu. Multi-Objective Emergency Material Vehicle Dispatching and Routing under Dynamic Constraints in an Earthquake Disaster Environment. ISPRS International Journal of Geo-Information. 2017, 6(5), 142.(SCI).",
	  "level": "SCI",
	  "image": "2017_4.png"
    },	
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Jinyun Xie, Wei Tu, Qingquan Li, Xiaomeng Chang, Chenglin Ma, Zhuiri Li, Lian Huang. A Parallel Map-Matching Approach for Large Volume Floating Car Stream Data. Geomatics and Information Science of Wuhan University, 2017, 42(5): 697-703. (谢金运, 涂伟*, 李清泉, 常晓猛, 马承林, 李追日. 大规模浮动车流数据并行地图匹配方法. 武汉大学学报信息科学版. 2017, 42(5), 697-703.) (EI).",
	  "level": "EI",
	  "image": "2017_3.png"
    },	
	{
      "year": "2017",
	  "type": "Conference papers",
      "article": "Xiaona Li, Wei Tu, Shaoqing Shen, Yang Yue, Nianxue Luo, Qingquan Li. Revealing spatial variation and correlation of urban travels from big trajectory data. ISPRS Geospatial Week 2017. 2017. Wuhan, China, 53-57.(EI).",
	  "level": "EI",
	  "image": "2017_2.png"
    },	
	{
      "year": "2017",
	  "type": "Journal article",
      "article": "Jinzhou Cao, Wei Tu*, Qingquan Li, Rui Cao. Spatio-temporal Analysis of Aggregated Human Activities Based on Massive Mobile Phone Tracking Data. Journal of Geo-information Science . 2017, 19(4), 467-474.（曹劲舟, 涂伟*, 李清泉, 曹瑞. 基于大规模手机定位数据的群体活动时空特征分析. 地球信息科学学报. 2017, 19(4), 467-474.）(CSCD)",
	  "level": "CSCD",
	  "image": "2017_1.png"
    },
	{
      "year": "2016",
	  "type": "Conference papers",
      "article": "Rui Cao, Wei Tu*, Jinzhou Cao, Qingquan Li. Comparison of Urban Human Movements inferring from multi-sources spatio-temporal data. International Society for Photogrammetery and Remote Sensing Congress 2016. 2016. Prague.(A&HCI).",
	  "level": "A&HCI",
	  "image": "2016_3.png"
    },
	{
      "year": "2016",
	  "type": "Journal article",
      "article": "Wei Tu*, Qingquan Li*, Zhixiang Fang, Shih-lung Shaw, Baoding Zhou, Xiaomeng Chang. Optimizing the locations of electric taxi charging stations: A spatial–temporal demand coverage approach. Transportation Research Part C: Emerging Technologies. 2016, 65, 172-189.(SCI).",
	  "level": "SCI",
	  "image": "2016_2.png"
    },
	{
      "year": "2016",
	  "type": "Journal article",
      "article": "Rui Cao, Wei Tu*, Baicong Chao, Nianxue Luo, Meng Zhou, Qingquan Li. Identification and Analysis of Home and Work Regions in the Vicinity of Metro Stations Using Smart Card Data. Journal of Geomatics. 2016, 41, 74-78. （曹瑞, 涂伟*, 巢佰崇, 罗年学, 周檬, 李清泉. 基于智能卡数据的地铁周边职住用地识别与分析. 测绘地理信息. 2016, 41, 74-78.(CSCD).）",
	  "level": "CSCD",
	  "image": "2016_1.png"
    },
	{
      "year": "2016",
	  "type": "Conference papers",
      "article": "Wei Tu, Rui Cao, Jinzhou Cao, Qingquan Li. Spatial-temporal variation of public transit ridership using smart card data and mobile phone data. Association of American Geographers Annual Meeting 2016. 2016. San Francisco,USA.",
	  "level": "none",
	  "image": "2016_01.png"
    },
	{
      "year": "2015",
	  "type": "Journal article",
      "article": "Wei Tu*, Qingquan Li*, Zhixiang Fang, Baoding Zhou. A Novel Spatial-Temporal Voronoi Diagram-Based Heuristic Approach for Large-Scale Vehicle Routing Optimization with Time Constraints. ISPRS International Journal of Geo-Information. 2015, 4(4), 2019-2044.(SCI).",
	  "level": "SCI",
	  "image": "2015_5.png"
    },
	{
      "year": "2015",
	  "type": "Journal article",
      "article": "Baoding Zhou , Qingquan Li*, Qingzhou Mao*, Wei Tu , Xing Zhang . Activity Sequence-Based Indoor Pedestrian Localization Using Smartphones. IEEE Transactions on Human-Machine Systems. 2015, 45(5), 562 - 574.(SCI).",
	  "level": "SCI",
	  "image": "2015_4.png"
    },
	{
      "year": "2015",
	  "type": "Journal article",
      "article": "Baoding Zhou, Qingquan Li*, Qingzhou Mao, Wei Tu, Xing Zhang, Long Chen. ALIMC: Activity Landmark-Based Indoor Mapping via Crowdsourcing. IEEE Transactions on Intelligent Transportation Systems. 2015, 16(5), 2774 - 2785.(SCI).",
	  "level": "SCI",
	  "image": "2015_3.png"
    },
	{
      "year": "2015",
	  "type": "Journal article",
      "article": "Wei Tu, Qingquan Li, Xiaomeng Chang, Yang Yue, Jiasong Zhu. A Spatio-Temporal Decision Support Framework for Large Scale Logistics Distribution in the Metropolitan Area. Advances in Spatial Data Handling. 2015.(EI).",
	  "level": "EI",
	  "image": "2015_2.png"
    },
	{
      "year": "2015",
	  "type": "Journal article",
      "article": "Meng Zhou, Wei Tu*, Qingquan Li, Yang Yue, Xiaomeng Chang. Inferring Individual Physical Locations with Social Friendships. Geoinfomatics 2015. 2015. Wuhan, China.(EI).",
	  "level": "EI",
	  "image": "2015_1.png"
    },
	{
      "year": "2015",
	  "type": "Conference papers",
      "article": "Jinzhou Cao, Wei Tu*, Qingquan Li, Meng Zhou, Rui Cao. Exploring the distribution and dynamics of functional regions using mobile phone data and social media data. 14th International Conference on Computers in Urban Planning and Urban Management. 2015. Boston, USA.",
	  "level": "none",
	  "image": "2015_01.png"
    },
	{
      "year": "2014",
	  "type": "Journal article",
      "article": "Wei Tu, Zhixiang Fang*, Qingquan Li, Shilung Shaw, Biyu Chen A bi-level Voronoi diagram-based metaheuristic for a large-scale multi-depot vehicle routing problem. Transportation Research Part E: Logistics and Transportation Review. 2014, 61, 84-97.(SCI).",
	  "level": "SCI",
	  "image": "2014_2.png"
    },
	{
      "year": "2014",
	  "type": "Journal article",
      "article": "Wei Tu*, Qingquan Li, Zhixiang Fang. Large Scale Multi-depot Logistics Routing Optimization based on Network Voronoi Diagram. Acta Geodaetica et Cartographica Sincia. 2014, 43(10), 1075-1082. (涂伟*, 李清泉, 方志祥. 基于网络Voronoi图的大规模多仓库物流配送路径优化. 测绘学报. 2014, 43(10), 1075-1082.) (EI).",
	  "level": "EI",
	  "image": "2014_1.png"
    },
	{
      "year": "2013",
	  "type": "Journal article",
      "article": "Wei Tu*, Qingquan Li, Zhixiang Fang. A Heuristic Algorithm for Large Scale Vehicle Routing Problem. Geomatics and Information Science of Wuhan University. 2013, 38(3), 307-310.(涂伟*, 李清泉, 方志祥. 一种大规模车辆路径问题的启发式算法. 武汉大学学报,信息科学版. 2013, 38(3), 307-310).(EI).",
	  "level": "EI",
	  "image": "2013_3.png"
    },
	{
      "year": "2013",
	  "type": "Journal article",
      "article": "Zhixiang Fang*, Wei Tu*, Qingquan Li*, Shih-Lung Shaw, Shunqing Chen, Biyu Chen. A Voronoi neighborhood-based search heuristic for distance/capacity constrained very large vehicle routing problems. International Journal of Geographical Information Science. 2013, 27(4), 741-764.(SCI).",
	  "level": "SCI",
	  "image": "2013_2.png"
    },
	{
      "year": "2013",
	  "type": "Conference papers",
      "article": "Xuan Sun, Yongchang Wei, Wei Tu. From CAD Design to Virtual Environment: Underground Pipeline Information System Construction for Smart City. International Conference on Frontier of Energy and Environment Engineering. 2013. Xiamen.(EI).",
	  "level": "EI",
	  "image": "2013_1.png"
    },
	{
      "year": "2013",
	  "type": "Conference papers",
      "article": "Wei Tu, Zhixiang Fang, Qingquan Li. An empirical analysis of Voronoi neighborhood characteristics of heuristic solutions for capitated vehicle routing problems. International Symposium on Recent Advances in Transport Modeling. OPTIMUM2013. 2013. Golden coast, Australia.",
	  "level": "none",
	  "image": "2013_01.png"
    },		
	{
      "year": "2012",
	  "type": "Journal article",
      "article": "Zhixiang Fang*, Shih-Lung Shaw, Wei Tu*, Qingquan Li, Yuguang Li. Spatio temporal analysis of critical transportation links based on time geographic concepts: a case study of critical bridges in Wuhan, China. Journal of Transport Geography. 2012, 23(1), 44-59.(SSCI).",
	  "level": "SSCI",
	  "image": "2012_2.png"
    },		
	{
      "year": "2012",
	  "type": "Journal article",
      "article": "Wei Tu, Zhixiang Fang, Qingquan Li, Shiwei Lu. A Fast Algorithm for Large Scale Vehicle Routing Optimization Based on Voronoi Neighbors. Journal of Geo-spaital Information Science, 2012, 14(6): 781-787. (涂伟, 方志祥*, 李清泉, 鲁仕维. 基于Voronoi邻近的物流车辆路径快速优化方法. 地球信息科学学报. 2012, 14(6), 781-78.)(CSCD).",
	  "level": "CSCD",
	  "image": "2012_1.png"
    },
	{
      "year": "2011",
	  "type": "Journal article",
      "article": "Zhixiang Fang*, Wei Tu*, Qingquan Li, Qingquan Li. A multi-objective approach to scheduling joint participation with variable space and time preferences and opportunities. Journal of Transport Geography. 2011, 19(4), 623-634.(SSCI).",
	  "level": "SSCI",
	  "image": "2011_1.png"
    },
	{
      "year": "2010",
	  "type": "Conference papers",
      "article": "Wei Tu, Zhixiang Fang, Qingquan Li. Exploring time varying shortest path of urban OD pairs based on floating car data.. 18th International Conference on Geoinformatics, Geoinformatics 2010. 2010. Beijing.(EI).",
	  "level": "EI",
	  "image": "2010_1.png"
    },
	{
      "year": "2008",
	  "type": "Conference papers",
      "article": "Wei Tu, Xueluo Nian, Chen Zhao. The study of the framework and key technology of mobile emergency response platform. 2008 PROCEEDINGS OF INFORMATION TECHNOLOGY AND ENVIRONMENTAL SYSTEM SCIENCES. 2008. Kaifeng, CHINA.(A&HCI).",
	  "level": "A&HCI",
	  "image": "2008_2.png"
    },
	{
      "year": "2008",
	  "type": "Journal article",
      "article": "Jun Zhou, Xianghong Hua, Wei Tu, Zhao Li. The design and realization of a small mobile emergency platform based on Mobile GIS. Engineering of Surverying and Mapping. 2008. 12(2): 39 - 43.周隽, 花向红*, 涂伟, 李昭. 基于移动GIS 的小型移动应急平台的设计和实现. 测绘工程. 2008, 17(2), 39-42.(CSCD).",
	  "level": "CSCD",
	  "image": "2008_1.png"
    }
   
  ]
}
